export const questions = [
    {
      title: "JavaScript - это ... ?",
      variants : ["Язык программирования для разработки фронтенда", "Язык разметки для создания веб-страниц", "Язык запросов к базам данных"],
      correct: 0,
    },
    {
      title: "Что такое CSS-препроцессор?",
      variants : ["нструмент для создания анимаций на веб-страницах", "Язык программирования для разработки фронтенда", "Инструмент, расширяющий возможности CSS"],
      correct: 2,
    },
    {
      title: "Что такое Bootstrap?",
      variants : [" Фреймворк для разработки фронтенда", "Язык программирования для разработки фронтенда", "Библиотека для создания анимаций на веб-страницах"],
      correct: 0,
    },
    {
      title: "Что такое API?",
      variants : ["Advanced Programming Interface", "Application Programming Interface", "Automated Programming Interface"],
      correct: 1,
    },
    {
      title: "Какие из этих инструментов используются для тестирования фронтенд приложений?",
      variants : ["MySQL", "Photoshop", "Jest"],
      correct: 2,
    },
    {
      title: "Что такое Single Page Application (SPA)?",
      variants : ["Подход к разработке веб-приложений, где все страницы загружаются одновременно", "Веб-приложение, состоящее из одной единственной страницы", "Технология, позволяющая создавать анимированные переходы между страницами"],
      correct: 1,
    },
    {
      title: "React - это ... ?",
      variants : ["Приложение", "Библиотека", "Фреймворк"],
      correct: 2,
    },
    {
      title: "из этих инструментов используются для управления версиями кода?",
      variants : ["Git", "Photoshop", "Slack"],
      correct: 0,
    },
    {
      title: "Какой из этих методов HTTP используется для отправки данных на сервер?",
      variants : ["POST", "GET", "DELETE"],
      correct: 0,
    },
    {
      title: "Что такое компонентный подход в разработке фронтенда?",
      variants : ["Подход, основанный на использовании компонентов для создания пользовательского интерфейса", "Подход, который использует только один файл для всего кода", "Подход, основанный на использовании компонентов для создания пользовательского интерфейса"],
      correct: 2,
    }
];